{
    "subredditData": [
      {
        "postId": "13ydrba",
        "postTitle": "AITA Monthly Open Forum June 2023: Reddit Survey Results",
        "username": "AITAMod",
        "created": 1685714723,
        "comments": 517,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/13ydrba/aita_monthly_open_forum_june_2023_reddit_survey/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Keep things civil. Rules still apply.&lt;/h1&gt;\n\n&lt;p&gt;This month we’ll be taking a break from our usual blabbing about the rules and instead share what you’ve said about us and the community! Or rather, what a representative sample of what y’all shared in the form of a survey reddit is beta testing: &lt;a href=\"/r/feedback_loop_beta\"&gt;r/feedback_loop_beta&lt;/a&gt;. Below are the compiled results in the report sent we&amp;#39;re sharing with you. We also had thousands of comments of feedback we&amp;#39;ve read through (but no easy way to share here).&lt;/p&gt;\n\n&lt;p&gt;Shoutout to &lt;a href=\"/u/agoldenzebra\"&gt;u/agoldenzebra&lt;/a&gt; for being the greatest, because this, and every project they run is just fantastic.&lt;/p&gt;\n\n&lt;h2&gt;Overall Satisfaction&lt;/h2&gt;\n\n&lt;p&gt;&lt;strong&gt;78.48%&lt;/strong&gt; of respondents are satisfied with your community.&lt;/p&gt;\n\n&lt;p&gt;Very Satisfied: &lt;strong&gt;19.28%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Satisfied: &lt;strong&gt;59.19%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Neither satisfied nor dissatisfied: &lt;strong&gt;16.14%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Dissatisfied: &lt;strong&gt;3.59%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Very Dissatisfied: &lt;strong&gt;1.79%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Benchmark overall satisfaction: &lt;strong&gt;67.16%&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h2&gt;User Intent&lt;/h2&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;table&gt;&lt;thead&gt;\n&lt;tr&gt;\n&lt;th align=\"left\"&gt;&lt;strong&gt;Intention&lt;/strong&gt;&lt;/th&gt;\n&lt;th align=\"left\"&gt;&lt;strong&gt;% of Respondents&lt;/strong&gt;&lt;/th&gt;\n&lt;/tr&gt;\n&lt;/thead&gt;&lt;tbody&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Opportunities to meet others who share my interests or experiences&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;3.14%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Learning new things or discovering new ideas&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;15.70%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Finding answers to specific questions that I have&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;5.38%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Feeling like part of something bigger than myself&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;12.56%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Watching or reading funny or entertaining content&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;87.00%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Relaxation or stress-relief&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;34.98%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;A way to pass the time when I’m bored&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;84.30%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;tr&gt;\n&lt;td align=\"left\"&gt;Looking for support or advice&lt;/td&gt;\n&lt;td align=\"left\"&gt;&lt;strong&gt;11.21%&lt;/strong&gt;&lt;/td&gt;\n&lt;/tr&gt;\n&lt;/tbody&gt;&lt;/table&gt;\n\n&lt;p&gt;[Users could select multiple options]&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h2&gt;Exposure to Harmful Content&lt;/h2&gt;\n\n&lt;p&gt;&lt;strong&gt;13.76%&lt;/strong&gt; of users in &lt;a href=\"/r/AmItheAsshole\"&gt;r/AmItheAsshole&lt;/a&gt; reported seeing harmful content a few times per week or more. (Benchmark: 14.04%)&lt;/p&gt;\n\n&lt;h2&gt;Community Rules&lt;/h2&gt;\n\n&lt;p&gt;&lt;strong&gt;76.06&lt;/strong&gt;% agree that the rules are appropriate for this community. (Benchmark: 70.76%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;74.17&lt;/strong&gt;% agree that the rules are clear and easy to understand.  (Benchmark: 71.30%)&lt;/p&gt;\n\n&lt;h2&gt;Moderation&lt;/h2&gt;\n\n&lt;p&gt;&lt;strong&gt;61.17&lt;/strong&gt;% feel that the community moderator team appropriately and consistently enforces the rules of this community. (Benchmark: 52.93%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;42.37&lt;/strong&gt;% agrees that the community moderator team takes feedback from the community into account when making decisions.  (Benchmark: 34.86%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;61.61&lt;/strong&gt;% trust the moderators to make decisions that benefit the community. (Benchmark: 55.72%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;8.21&lt;/strong&gt;% have interacted directly with a moderator (Benchmark: 6.95%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;31.25&lt;/strong&gt;% that interacted directly were satisfied with that interaction.(Benchmark: 45.00%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;55.38%&lt;/strong&gt; have observed interactions between moderators and other users. (Benchmark: 51.38%)&lt;/p&gt;\n\n&lt;h2&gt;Community Culture&lt;/h2&gt;\n\n&lt;p&gt;&lt;strong&gt;70.16%&lt;/strong&gt; feel that people generally behave appropriately. (Benchmark: 71.68%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;34.62%&lt;/strong&gt; feel like a member of the community. (Benchmark: 38.08%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;56.10%&lt;/strong&gt; think people in the community are good at influencing each other. (Benchmark: 44.63%)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;7.69%&lt;/strong&gt; have a good bond with others in the community. (Benchmark: 12.05%)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;And there we are, these are all of the data points shared! If you have questions about context of any of this, please ask away in the comments. The report itself is 15 pages, far too long to include all of the explanation in this post.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re still reviewing this as a team, and seeing what we have to learn. We&amp;#39;d love to hear your thoughts as well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "AITAMod",
          "karma": 18500,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_2.png"
        }
      },
      {
        "postId": "14atiwo",
        "postTitle": "AITA for not letting my sister use \"the family property\" for her upcoming wedding?",
        "username": "Throwrasistaplz",
        "created": 1686912187,
        "comments": 1566,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14atiwo/aita_for_not_letting_my_sister_use_the_family/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am 25, my sister is 29 (I also have a younger sister, 8). When I was 14, my mom sent me to live with her parents. Her excuse was that they needed me to help out. I believe she just didn&amp;#39;t want to deal with a growing male teen.&lt;/p&gt;\n\n&lt;p&gt;My grandparents owned an amazing property in the mountains that has an amazing view. We also have some horses and other critters. They were also quite wealthy as well.&lt;/p&gt;\n\n&lt;p&gt;They both passed 4 years ago a month apart. They gave me the property (because &amp;quot;I would appreciate and respect it more&amp;quot;) while my mom and sister(s) got money and other assets(overall valued moer than the property).&lt;/p&gt;\n\n&lt;p&gt;In the past 4 years, I turned part of the property into a venue for mainly weddings (GPs knew of this idea and thought it was a good one).&lt;/p&gt;\n\n&lt;p&gt;We are busy and usually booked about 8 months out. My sister got engaged 1.5 years ago and said she wasn&amp;#39;t to get married at the property. I said yes, just let me know the date as soon as possible so I can make sure it is &amp;quot;booked.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I never got a date. I followed up several times and kept asking her, and she would brush me off. 2 weeks ago I got the wedding invitation. Stating the property is the location and the date. Which is in September of this year. I immediately called her to say that we have booked for that date and can&amp;#39;t accommodate her.&lt;/p&gt;\n\n&lt;p&gt;Well, now her, my mom, other family, her partners family, as well as other flying monkeys have been blowing up on me. They are also calling and writing reviews for my business.&lt;/p&gt;\n\n&lt;p&gt;I asked them to stop and call my sister telling her that I literally all she had to do was tell me when she knew her date so I could block it and I would take care of everything else.&lt;/p&gt;\n\n&lt;p&gt;She went off on how I am ruining HER day. It is OUR family&amp;#39;s property. How she already sent out the invitations and couldn&amp;#39;t go back now. I should just tell the other couple to cancel (they have been on the books for over a year now, and I actually like them). Family is more important.&lt;/p&gt;\n\n&lt;p&gt;After the last big blow-up, I started communicating strictly through the business. Using our recorded line as well as email. I suggested 3 other dates around the same time, but that&amp;#39;s not good enough. &amp;quot;I&amp;#39;m being resentful and an AH.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;TLDR: I own a property/popular wedding venue property that my sister wants to get married on, but she didn&amp;#39;t tell me the dates until a few months before. It is booked for the day she wants. She already sent out invitations (how I found out). Since I won&amp;#39;t cancel the other couples&amp;#39; reservations, I&amp;#39;m being called an AH. &lt;/p&gt;\n\n&lt;p&gt;ETA Thank you all for the overwhelming response. I thought I was going crazy. I&amp;#39;ll try to respond to prople later when I have some time. Thank you for all the advice and responses.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Throwrasistaplz",
          "karma": 3753,
          "pfp": "https://styles.redditmedia.com/t5_8mbfp2/styles/profileIcon_snoo-nftv2_bmZ0X2VpcDE1NToxMzdfZWI5NTlhNzE1ZGZmZmU2ZjgyZjQ2MDU1MzM5ODJjNDg1OWNiMTRmZV83MzEwMjc_rare_b63b0189-0f13-498f-8707-8c7f241a9a16-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=db80deef8ea7d2728b00e55204a86e72594b7dd2"
        }
      },
      {
        "postId": "14aw0cn",
        "postTitle": "AITA for exposing my half-sister's lies about our childhood?",
        "username": "Opening_Kangaroo_652",
        "created": 1686919745,
        "comments": 2934,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14aw0cn/aita_for_exposing_my_halfsisters_lies_about_our/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (24F) have a half-sister (27F), we&amp;#39;ll call her Taylor.&lt;/p&gt;\n\n&lt;p&gt;My dad had weekend visitation with Taylor at our house until I was 8, and it was the worst. She bullied me really badly any time I saw her, to the point that I would scream every time my dad even mentioned her coming over. Even if we were kept apart, she would break my things, upset my pets, and tell lies about me. Every week her mom would end up in the kitchen screaming at my parents.&lt;/p&gt;\n\n&lt;p&gt;Taylor&amp;#39;s mom died when she was 11. Her mom didn&amp;#39;t have any family able to take her in, and nor did my dad. My dad was the only one who could get custody.\nWhen I was told about this, I freaked out. Screaming, crying for hours, calling my grandparents and demanding to live with them, all of it. My mom wasn&amp;#39;t willing to have Taylor in the house on that basis, and I&amp;#39;m pretty sure she said she would move out if my dad pushed the issue. Taylor ended up being sent to boarding school the next year, and she would go to stay with other members of my dad&amp;#39;s family during breaks. When I was 14 my parents divorced, and I would see Taylor every few months at my dad&amp;#39;s during school breaks. I&amp;#39;d learnt to stand up for myself and she&amp;#39;d grown up so there was no bullying, but we&amp;#39;d bicker - she was hostile and I never backed down. I didn&amp;#39;t see her much after she went to college, and then I went to college far away as well.&lt;/p&gt;\n\n&lt;p&gt;We now live in the same small city (I moved here in March). It&amp;#39;s the kind of place where everyone from each generation knows or knows of each other. I had never encountered Taylor socially and never mentioned knowing her, but I had met her boyfriend and his friends are part of my larger social group. The other night, I was at a party, and Taylor and her bf were there as well. We made eye contact and waved, but she pretty much avoided me all night. During the night, our mutual friends asked how I know Taylor, and I said we are half sisters. They all looked super uncomfortable and I pressed for an explanation. Basically, Taylor&amp;#39;s been telling everyone that she was homeless as a kid because her stepmother and half-sister hated her and demanded she be shipped off to boarding school and made her dad ignore her. Were it not for the fact that it was obviously going to come out sooner or later that we are related, I probably wouldn&amp;#39;t have bothered to set the record straight. As it was, I&amp;#39;m going to be around these people for a long time, and I didn&amp;#39;t feel I should have had to walk around burdened by the weight of her lies. So I told the group the context.&lt;/p&gt;\n\n&lt;p&gt;She called me yesterday to yell at me. Apparently she&amp;#39;s being ostracised from the group, her relationship is in trouble, her career opportunities are in jeopardy, etc. I don&amp;#39;t see how any of this is my fault because she&amp;#39;s the one who lied, but according to some people I should have been a bit more gentle in my retelling of the facts because it&amp;#39;s her &amp;#39;experience&amp;#39; and I&amp;#39;ve basically blackballed her.&lt;/p&gt;\n\n&lt;p&gt;EDIT - I didn’t have space for this, but just to clarify what I actually said to the friends. I explained that the reason my mom didn’t want Taylor to live with us was because of the bullying, and that when they split my dad still didn’t have Taylor live with him, and that I only stayed with him on weekends (Taylor told them I moved in with my dad so that she couldn’t). I also told them it wasn’t true that I told my dad not to finance Taylor’s business when she was 20…because I didn’t. That was pretty much the gist of it.&lt;/p&gt;\n\n&lt;p&gt;Edit 2 (it was suggested I add this from the comments): I know the answer to these.&lt;/p&gt;\n\n&lt;p&gt;My mom didn’t say to send her to boarding school. What my mom said was, Taylor is not living in this house with my daughter, if that means we split, then we split. My dad didn’t want to be a full time parent by himself, so he stayed with my mom, and since he didn’t have any other family Taylor could live with for various reasons, he sent her to boarding school.&lt;/p&gt;\n\n&lt;p&gt;My dad never cut contact with Taylor. He visited her at school (it was about an hour away) and sometimes he’d see her at other relatives’ places during school breaks. When he moved out, Taylor would occasional spend the day and maybe one break a year at his place.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Opening_Kangaroo_652",
          "karma": 7578,
          "pfp": "https://styles.redditmedia.com/t5_8mcdzm/styles/profileIcon_snoo-nftv2_bmZ0X2VpcDE1NToxMzdfZWI5NTlhNzE1ZGZmZmU2ZjgyZjQ2MDU1MzM5ODJjNDg1OWNiMTRmZV81MzEwMjc4_rare_e0a8923b-0a13-4e69-befe-cb4328ec3d04-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=a26c949f13bb473dd17162c225cb3b7e56fd412a"
        }
      },
      {
        "postId": "14b3f3a",
        "postTitle": "AITA for not pushing my family to include my fiancée in Christmas card photos?",
        "username": "ffldcouple",
        "created": 1686938182,
        "comments": 1030,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b3f3a/aita_for_not_pushing_my_family_to_include_my/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (37m) am engaged to my fiancée (31f), planning on getting married at the end of this year. My family takes a Christmas card photo every year, usually around big events like graduations or parties when everyone is together (which isn’t often). Years ago, my mom instituted a “not until you’re married” policy to including SOs in photos, and applied that rule to my brother when he was dating, and engaged to, his now-wife.&lt;/p&gt;\n\n&lt;p&gt;My fiancée has had significant issues with this. Last year, when the family took photos shortly after she and I were engaged, she directed many snide comments to me about how excluded she feels. This year, she flatly refused to drive with me to a family graduation, saying how hurt and excluded she felt by this policy “since we are getting married this year and the card is coming out the year we are getting married.” I’ve tried to explain that this isn’t our card, this isn’t our right to tell others who can and can’t be on their card, and we could always have our own card to start our own tradition.&lt;/p&gt;\n\n&lt;p&gt;She’s made several comments around how surprised she is that I haven’t stood up for her to my mother, even telling me that she’s discussed the issue with others and they also are surprised that I wouldn’t take a stand with my mother on this.&lt;/p&gt;\n\n&lt;p&gt;She also made a point multiple times to say “good, less time to spend on photos with them at the wedding,” implying a tit-for-tat response to this policy.&lt;/p&gt;\n\n&lt;p&gt;I don’t really know what to do. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "ffldcouple",
          "karma": 1275,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png"
        }
      },
      {
        "postId": "14b0j39",
        "postTitle": "AITA for grounding my daughter after she called me a liar?",
        "username": "Kindly_Seesaw_6200",
        "created": 1686931094,
        "comments": 794,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b0j39/aita_for_grounding_my_daughter_after_she_called/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My husband (m47) and I (f40) are getting divorced, we have three kids together Amelie (f17), (m15) and (m4). &lt;/p&gt;\n\n&lt;p&gt;When my husband and I met we both were married to other people, he was my ex&amp;#39;s husband coworker, we met in one of their company&amp;#39;s parties, we hit it off and we had an affair before we got divorced to start dating. Amelie was born shortly after we got divorced. &lt;/p&gt;\n\n&lt;p&gt;We never felt like we should tell all of this to our kids when they were growing up, mainly because they were too young. Neither him or I had kids with our ex&amp;#39;s, so we just throw away our weddings photos and pretended neither of those marriages happened. When/ if the kids asked how we met we told them it was though common friends. &lt;/p&gt;\n\n&lt;p&gt;Well now that we&amp;#39;re getting divorced, Amelie has picked her dad&amp;#39;s side. I can&amp;#39;t really stop her from seeing him whenever she wants because our custody agreement is not over yet, so she often goes to his house after school/ spends the weekends with him. He told her the truth, he&amp;#39;s trying to get her to believe that I&amp;#39;m wrong in all of this (although all I&amp;#39;m doing is supporting my son), he&amp;#39;s trying to get her against me and against her brother.  She told her that he has always wanted to tell them the truth but I didn&amp;#39;t &amp;quot;allow&amp;quot; it since it would make me look bad. That&amp;#39;s obviously a lie, but Amelie believed him. When she came back home she started arguing with me about why I never told her the truth, she called a &amp;quot;lying bitch&amp;quot;. I tried to explain to her the truth and what her dad is trying to do, she told me she never wants to see me again and such. I got sick of that and grounded her, I took her phone and sent her to her room. &lt;/p&gt;\n\n&lt;p&gt;This morning she wasn&amp;#39;t talking to me, all she told me is that she hates me and will try to leave to live with her dad. My coworker thinks I was an asshole for grounding her, she&amp;#39;s a confused teenager, I don&amp;#39;t know what to believe really, so I&amp;#39;d like to read some outsider perspectives please.&lt;/p&gt;\n\n&lt;p&gt;Edit: our oldest son came out as trans, his dad isn&amp;#39;t supportive at all, quite the opposite, that&amp;#39;s why we&amp;#39;re getting divorced. He&amp;#39;s trying to get Amelie against her brother.&lt;/p&gt;\n\n&lt;p&gt;Edit again: Amelie is not a product of an affair, I got pregnant with her after both our divorces were over&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Kindly_Seesaw_6200",
          "karma": 721,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_7.png"
        }
      },
      {
        "postId": "14aoqg1",
        "postTitle": "AITA for not including my SIL in photos during my bachelorette party because she wore white?",
        "username": "StrangeAir9373",
        "created": 1686895502,
        "comments": 2816,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14aoqg1/aita_for_not_including_my_sil_in_photos_during_my/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m getting married (yay!) and my brother &amp;quot;John&amp;quot; asked me to include his girlfriend &amp;quot;Sarah&amp;quot; as a bridesmaid as a way to get her involved with our family since he wants to propose soon. I wasn&amp;#39;t happy (she&amp;#39;s quite snobbish, almost in a comically villainous way. She once made fun of the fact that I get most of my groceries from the local big box super center and not somewhere with more &amp;quot;high quality product&amp;quot;).&lt;/p&gt;\n\n&lt;p&gt;But I love John and it mattered a lot to him, so I agreed.&lt;/p&gt;\n\n&lt;p&gt;Onto the issue: on the final night of my bachelorette party, we decided to have one &amp;quot;big&amp;quot; meal that was really pricey and fancy that we all saved up for. Sarah said she had to take an emergency work meeting and for us to go ahead first (the restaurant was walkable from our hotel).&lt;/p&gt;\n\n&lt;p&gt;Guys, when Sarah showed up, I was FLOORED. She came in a white sparkly sequin number with a tulle skirt and a tiara. When we were planning the trip, my MOH made it abundantly clear that everyone was supposed to wear pink so we could get a really cute photo together at the restaurant.&lt;br/&gt;\nI&amp;#39;m not even kidding, her outfit was so bridal looking the waitress actually asked if we were having a joint bachelorette party. I was so upset, that when it came time to take photos I absolutely refused to have Sarah in them.&lt;/p&gt;\n\n&lt;p&gt;She said it wasn&amp;#39;t her fault because she &amp;quot;didn&amp;#39;t get the memo&amp;quot;, but I told her it was common sense to not wear a bridal looking dress to a bachelorette party if you&amp;#39;re not the bride!Plus, she was in the group chat and even made comments about another girl&amp;#39;s outfit when we were talking about what we wanted to wear, so I know she knew!&lt;/p&gt;\n\n&lt;p&gt;All of my friends were on my side and they made sure she didn&amp;#39;t end up in the photos. When we got home, she pitched a fit to my brother saying that we bullied her at my party and deliberately left her out. She was also pissed because a lot of family and friends noticed she wasn&amp;#39;t in the photos and I wasn&amp;#39;t afraid to tell them exactly why.&lt;/p&gt;\n\n&lt;p&gt;My brother&amp;#39;s really upset though because she&amp;#39;s been crying and whining about it nonstop since. Apparently they&amp;#39;re both so mad that they&amp;#39;re going to skip father&amp;#39;s day brunch, so the whole thing is blowing up even more.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m starting to feel bad because my mom told me that my brother and Sarah were fighting a lot now, so I&amp;#39;m not sure if I&amp;#39;m being the AH here. My brother called me a bridezilla, but I really feel like Sarah was trying to ruin my night.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "StrangeAir9373",
          "karma": 4130,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_4.png"
        }
      },
      {
        "postId": "14av7mr",
        "postTitle": "WIBTA If i got high before a flight with my friend and her 1 year old baby?",
        "username": "dreamygoddess7",
        "created": 1686917477,
        "comments": 816,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14av7mr/wibta_if_i_got_high_before_a_flight_with_my/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT/UPDATE - thanks for all the advice! I have decided not to get high out of fear that I could have a bad high because I’m at the airport not a home setting when I am infact a hermit. (I had not considered this previously) Might just wake and bake early morning (we fly late afternoon) and pop a propranolol (prescribed by my doctor) when we board the plane. \n/&lt;/p&gt;\n\n&lt;p&gt;so tomorrow im going on holiday with two of my friends and one of them is bringing along their 1 year old daughter.&lt;/p&gt;\n\n&lt;p&gt;my friend is adamant that her child will be asleep at the airport and throughout the flight and transfers to the hotel but I’m not so sure as I baby sit for her often and she’s not a great sleeper, I fear the flight and travel will be quite stressful for us all&lt;/p&gt;\n\n&lt;p&gt;i hate flying, i get so anxious - for this reason its been nearly 10 years since i last got on a plane.&lt;/p&gt;\n\n&lt;p&gt;i dont drink alcohol but i do smoke weed, ive got some edibles that i was thinking of eating before the flight so that i could just sleep and be chilled and happy during our travels...&lt;/p&gt;\n\n&lt;p&gt;would this make me abit of an asshole because obviously i wont be much help with the baby whilst im high?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "dreamygoddess7",
          "karma": 10274,
          "pfp": "https://styles.redditmedia.com/t5_6e6aa1/styles/profileIcon_snoo331c0a9c-0ebb-4eb5-8a4e-7bef5db8bbae-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=6efc257b0d4992e25066eedb0234b8a099c3a782"
        }
      },
      {
        "postId": "14awzth",
        "postTitle": "AITA for establishing a boundary that I knew my Mom would never respect",
        "username": "pervdurabo",
        "created": 1686922377,
        "comments": 259,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14awzth/aita_for_establishing_a_boundary_that_i_knew_my/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long time lurker, first-time posting to AITA.&lt;/p&gt;\n\n&lt;p&gt;Myself (29) and my partner ‘X’ (31M) recently bought our first home together. We love our new community, but X has struggled with losing our big friend group and his family from back home. My own family consists of just my Mom, and she has lived far away from me for a few years already so it has been a softer adjustment for me. For context - X is a recovering addict and alcoholic. &lt;/p&gt;\n\n&lt;p&gt;About a month ago, shortly after moving in and still very stressed from the move, my partner had a lapse in recovery and drank a few beers that a neighbor had left on our porch. Although he didn’t get really drunk, I was worried and concerned that he drank and then tried to hide it from me. He admitted he shouldn’t have drank and said he wanted to do some thinking and went and sat outside in our garden. &lt;/p&gt;\n\n&lt;p&gt;I needed to talk to someone, mostly just to vent, so I called my mom. She routinely calls me 3-4 times a week to complain about her co-workers and neighbors so I didn’t think it would be a big deal. The whole time we were talking she was very unsupportive and disengaged (had the TV on) and so when my phone died mid-conversation, I did not rush to call her right back. I plugged in my phone and instead of waiting for it to turn back on, I went outside to talk to X and check on him. &lt;/p&gt;\n\n&lt;p&gt;When I came back inside (15 minutes later) my phone was ringing off the hook and when I answered, it was a police officer asking me to confirm my name and address. The cop informed me that officers were on their way to me as someone had called in a ‘Wellness Check’. I immediately called my mom and she proudly admitted to calling them. Myself and X have always been pretty vocal about our distrust of police back home. Although my Mom does not agree with this opinion, she is VERY aware of it. &lt;/p&gt;\n\n&lt;p&gt;Five cop cruisers showed up on our lawn - they questioned us both and repeatedly tried to force their way into our home. They ended up leaving after about an hour but their presence was very intimidating and uncomfortable for both myself and X. &lt;/p&gt;\n\n&lt;p&gt;When the police finally left and we cooled off, I called my Mom to demand an explanation. She claimed that “hanging up on her&amp;#39;&amp;#39; was suspicious but when I pushed back on that excuse (not charging my phone has been a lifelong bad habit of mine) she got angry and said it was my own fault, among other nasty things. When I told her the experience was scary for us she accused me of being dramatic and laughed at me. &lt;/p&gt;\n\n&lt;p&gt;I didn’t want to fight with her and flat out said that if she couldn’t apologize for calling the police unnecessarily that I would no longer be speaking to her as I don’t trust her anymore. She hung up on me and I haven’t heard from her since. &lt;/p&gt;\n\n&lt;p&gt;AITA for enforcing this boundary? My mom has never apologized in her life and I knew that when I insisted on an apology. I’m still upset with her, but as the weeks pass by I&amp;#39;m feeling more and more guilty as she has no friends and I am her only family she can talk to.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "pervdurabo",
          "karma": 9206,
          "pfp": "https://styles.redditmedia.com/t5_1z33yr/styles/profileIcon_snoo6ac1c27a-f27f-4ff0-b104-883e4a5c37cd-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=1abdf1149b2dc46fcf211b011cffc63be4b01325"
        }
      },
      {
        "postId": "14awbpp",
        "postTitle": "AITA for not being sorry my best friend had to cut her honeymoon short?",
        "username": "random_blurb394",
        "created": 1686920579,
        "comments": 235,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14awbpp/aita_for_not_being_sorry_my_best_friend_had_to/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I(29F) have been friends with Amber-fake name- for 10 years now.&lt;/p&gt;\n\n&lt;p&gt;Amber and her then fiancé are a bit kinky, and she is an over sharer, so I was pretty well informed about their sex life.&lt;/p&gt;\n\n&lt;p&gt;Her fiancé had to go back to his home country for about a month before the wedding, and they decided that they will not have sex until their wedding day. So that will be almost 7 weeks without sex.&lt;/p&gt;\n\n&lt;p&gt;Amber then decided, since they were very into nipple play, to get her nipples pierced as a surprise to him. Now, I am not that knowledgeable about piercing, but I know that they take a long time to heal.&lt;/p&gt;\n\n&lt;p&gt;So after a very quick google search, I told her that it will take a lot longer for them to heal than 7 weeks, especially if they are planning to play as hard as they usually do. She dismissed me, said she knew her body better than anyone, that she healed fast... After I tried to convince her once more, she called me a prude. So I dropped it.&lt;/p&gt;\n\n&lt;p&gt;They got married last Saturday, then went on their honeymoon. 4 days in, they are back, she is in the hospital, and the doctor took out the piercings, and banned them from doing anything breast related for 2 months.&lt;/p&gt;\n\n&lt;p&gt;Then she spent a whole 4 hours venting to me. At first I tried to comfort her, but then she started talking about going back to the one who did the piercing, and giving them a &amp;quot;scolding&amp;quot; for not explaining things to her. I told her that they did their job and warned her, I also warned her, and that the blame is on her, and maybe on her husband (I don&amp;#39;t know if he was told how long it would take for them to heal fully).&lt;/p&gt;\n\n&lt;p&gt;And suddenly I am an AH for not being sympathetic. Our friends are kind of mostly on her side, because she is genuinely sad about cancelling her honeymoon, as it is her first vacation in 5 years.&lt;/p&gt;\n\n&lt;p&gt;So AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "random_blurb394",
          "karma": 491,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_4.png"
        }
      },
      {
        "postId": "14ayg6u",
        "postTitle": "AITA for leaving brothers GF out of baby shower?",
        "username": "rolezxx",
        "created": 1686926015,
        "comments": 805,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14ayg6u/aita_for_leaving_brothers_gf_out_of_baby_shower/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 20F. I had my son about a month ago. \nI live with at my moms and decided to have a baby shower after giving birth. The baby shower was held at our moms and I just wanted close family. My brother(28) and his girlfriend(26) have been together 5 years. They live together out of state from us, so we only see them a couple times a year. I sent an invite to brother obviously. &lt;/p&gt;\n\n&lt;p&gt;For the shower I made shirts for family members that said “mom, dad, grandma” etc\nI thought it would be cute for photos. I had an uncle shirt for my brother and he brought his gf with. I didn’t have a shirt for her. They’re not married, so I didn’t think to make an “aunt” shirt for her, or include her in family photos. Once the shirts were handed out she sat in the living room alone and was on her phone. It was awkward. \nI didn’t let her hold the baby because her body language was closed off during the party and my brother was accommodating her half the time. I barely got to spend time with him. She was free to eat and join games but she didn’t seem interested, and they ended up leaving early to go to her dads. (who also lives in the same city as us) Once the night passed my mom called my brother to ask what was up and my brother said his gf was very upset and felt excluded like she’s not apart of our family. The party was literally for my newborn son and now it turned into drama. I feel like my brother is mad at me over this. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "rolezxx",
          "karma": 386,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_0.png"
        }
      },
      {
        "postId": "14axmev",
        "postTitle": "AITA for making my daughter go to her mother's funeral?",
        "username": "Brokenguy_86",
        "created": 1686924020,
        "comments": 628,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14axmev/aita_for_making_my_daughter_go_to_her_mothers/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (35M) was married years ago to the love of my life but we got divorced before my (now 13yo) daughter turned one.&lt;/p&gt;\n\n&lt;p&gt;To make a long story short ex-wife cheated on me both before and during her pregnancy and although I tried to save our marriage she wanted out.&lt;/p&gt;\n\n&lt;p&gt;In a nutshell, she said wasn&amp;#39;t ready for marriage and only said yes because she loved me at the time.&lt;br/&gt;\nShe grew tired of me and abandoned my daughter and me.&lt;/p&gt;\n\n&lt;p&gt;Over the years I only saw her twice, once on someone&amp;#39;s motorcycle where she seemed happy, and another time at a bar where we spoke a little.&lt;/p&gt;\n\n&lt;p&gt;Two months ago I received news that she died and I was torn up. I never loved anyone like I did her so I was devastated. I quickly got in touch with the few friends and family of hers that I could find and set up the funeral.&lt;/p&gt;\n\n&lt;p&gt;The issue started when my daughter refused to go. She is as hard-headed as her mother was so I had to basically drag her to the church.&lt;/p&gt;\n\n&lt;p&gt;I knew she was acting up because she didn&amp;#39;t know her mom but this was her last chance to say goodbye and I didn&amp;#39;t want her to regret it in the future.&lt;/p&gt;\n\n&lt;p&gt;She didn&amp;#39;t talk to me the entire service and when we got home she locked herself in her room.&lt;/p&gt;\n\n&lt;p&gt;Later she said I only wanted to go to the funeral because I wasn&amp;#39;t over her which stung and although I admit I cried I was mad because she didn&amp;#39;t know anything about her other than what people said.&lt;/p&gt;\n\n&lt;p&gt;Her grandmother said I shouldn&amp;#39;t have brought her to the funeral but it seemed like the right thing to do. I know her mom loved her deep down but didn&amp;#39;t get the chance to tell her. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Brokenguy_86",
          "karma": 307,
          "pfp": "https://styles.redditmedia.com/t5_8ivhob/styles/profileIcon_snoo7936a264-cfdd-42dc-9b90-615a24333aac-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=ce3e77e16c4a4c42ff5d48c11ed2d70ce0d0fb45"
        }
      },
      {
        "postId": "14b09rk",
        "postTitle": "AITA for waking up my neighbour’s 4 year old at 11PM?",
        "username": "Lucky-Lie-1131",
        "created": 1686930450,
        "comments": 384,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b09rk/aita_for_waking_up_my_neighbours_4_year_old_at/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in a townhouse complex - I share 3/4 walls. Each unit has a rooftop patio, and the only thing that separates our patios are wooden fences.&lt;/p&gt;\n\n&lt;p&gt;Yesterday, we had some workmen in the house. They must have not closed the door to the roof properly because at 10:30PM last night my partner finds the door wide open. It was raining and our cat was gone.&lt;/p&gt;\n\n&lt;p&gt;We searched everywhere, both inside and outside, calling her name in hopes she would come. I had to check the bushes all up and down the base of our units for her body - which luckily I didn’t find.&lt;/p&gt;\n\n&lt;p&gt;I decide to ring the doorbells of my neighbours to see if she walked the narrow ledge to one of their patios. I checked to see if the lights were on, then rang the doorbell of my neighbour to the right. They were the nicest people - should mention that we have never really spoken to any of our neighbours in 2 years of living here - and they brought me up to their patio to look for her. Even leant me a headlamp to help me see better in the rain. &lt;/p&gt;\n\n&lt;p&gt;When that failed, I went to my neighbour on the left. I could see lights on through the window, so I rang the doorbell.&lt;/p&gt;\n\n&lt;p&gt;Our doors are all frosted glass, with a small frame of transparent glass around the edges. A man comes to the door, but doesn’t open it. He just stares at me through the sliver of glass. I yell at him through the door that my cat is missing, and would he be willing to check his patio for her. I think I see him nod, and he leaves. I wait (in the rain) and he eventually returns. He opens the door a sliver and tells me there was no cat. Then, he says “I have kids”. I’m not really sure what to do with this information at this point, so I apologize and tell him that I wouldn’t have bothered him if it weren’t an emergency. Then I go back to looking.&lt;/p&gt;\n\n&lt;p&gt;We did find her eventually and I went to bed that night at 11:30PM. We found her, dried her off, I had a tall glass of water to calm my nerves, got ready for bed, scrolled some tik tok, and went to sleep. I hope that gives some indication of the time that we found her, because I wasn’t looking at my watch.&lt;/p&gt;\n\n&lt;p&gt;So this morning I hear my doorbell ring multiple times. I rush downstairs - because no one has ever rung my doorbell that much, usually it’s one and done. It was the neighbour’s wife. &lt;/p&gt;\n\n&lt;p&gt;When I opened the door she yells at me for ringing her doorbell &amp;quot;at midnight&amp;quot; and waking up her 4 year old. I don’t handle confrontation well. My therapist says that I choose the secret third option from “fight or flight” which is apparently “freeze”.&lt;/p&gt;\n\n&lt;p&gt;So, I told her my cat was missing and went to shut the door. She then tried to physically stop me from closing the door. I manage to get the door shut, and am hurriedly locking it when I hear her yell that she would call the cops on me if I ever did it again. At this point I am already running back up the stairs two at a time, and the only thing I can think to yell back as I’m retreating is “you’re a bitch!”&lt;/p&gt;\n\n&lt;p&gt;No idea if she heard me.&lt;/p&gt;\n\n&lt;p&gt;So, am I the asshole?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Lucky-Lie-1131",
          "karma": 282,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14auh2h",
        "postTitle": "AITA for disregarding friends list of baby names?",
        "username": "Curious-Aerie-221",
        "created": 1686915246,
        "comments": 557,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14auh2h/aita_for_disregarding_friends_list_of_baby_names/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for spelling or grammatical errors, english isn’t my first language.&lt;/p&gt;\n\n&lt;p&gt;I’m (26) pregnant and my bf (29) and I are extremely happy.&lt;/p&gt;\n\n&lt;p&gt;We have similar aged friends that we have told about the pregnancy. They were very happy for us, but one couple in particular hadn’t even known about our pregnancy for more then 15 minutes before they gave us a list of 30+ names we absolutely could not use under any circumstances. \nNormally I would be considerate about such a thing, we have family related names on our own list, and understand how it could be heartbreaking to have someone else use it in front of you.&lt;/p&gt;\n\n&lt;p&gt;However, their list more or less consists of the most used names from the last few years, I’ve asked them on multiple occasions if any of the names have some special significance to them and every time they’ve said no. They simply just like them.&lt;/p&gt;\n\n&lt;p&gt;We are expecting our baby in a few months whereas this couple aren’t even trying to make a baby and aren’t planning on it for a few more years. They have been together way longer then my bf and I and have been talking about baby names for the last 5+ years, but as far as I have understood and am aware, their list constantly changes.&lt;/p&gt;\n\n&lt;p&gt;So we’ve told them that we aren’t gonna go out of our way to pick a name from their list but that we also won’t steer clear of them just because they like them. \nThis has resulted in them calling us all sorts of names and they’ve brought it up at “family” birthdays (where we’ve been invited) where their family takes their side. &lt;/p&gt;\n\n&lt;p&gt;So AITA for disregarding their 30+ list of common baby names when we pick our name?&lt;/p&gt;\n\n&lt;p&gt;Edit: a few people have commented that we shouldn’t have accepted the list. \nThat’s not the case, after initially telling them about the pregnancy they were very happy for us, they asked if we’d thought about names and we told them we had a few in mind, and that’s when they told us about their off limit names. The reason we didn’t stop them was because we honestly felt quite taken aback in the moment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Curious-Aerie-221",
          "karma": 520,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14auxc3",
        "postTitle": "AITA for saying to my partner he needs to figure out where to hang up a dishcloth on his own because he’s a grown adult?",
        "username": "ecraguaeb",
        "created": 1686916653,
        "comments": 777,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14auxc3/aita_for_saying_to_my_partner_he_needs_to_figure/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, my partner and I have been together for three years now, living together for most of it, and we argue quite a lot about household chores.\nThe other day, we were both in the kitchen, about to make dinner. He wanted to cook for us, but before we started, the kitchen was messy. I asked him if he could clean up his dishes from the day, and I offered to clean the hob and the kitchen side so they would be ready to be used for cooking.&lt;/p&gt;\n\n&lt;p&gt;After we both finished, he had washed up, but he left the sponges and dishcloths wet in the sink. I politely asked him not to leave them there because they would become moldy, and I requested that he take the sponge out of the sink and hang the dishcloth out to dry. Instead, he stuffed them into a compartment on the drying rack where they obviously wouldn&amp;#39;t dry. I pointed out his mistake, and he responded by asking where exactly I wanted him to put them, implying that his choice wasn&amp;#39;t right. I told him that as a grown adult, I simply wanted him to choose somewhere to hang them up himself, as I didn&amp;#39;t want to be responsible for all the decisions. &lt;/p&gt;\n\n&lt;p&gt;Instances like this happen quite frequently. For example, he often misplaces items and asks me where they are, which is fine, but he never puts a system in place to reduce this issue, and it ends up impacting both of our lives. I seem to be the only one to remember what groceries we need, remembering to buy toiletries, towels and bedding laundry, just keeping on top of the household chores in general. &lt;/p&gt;\n\n&lt;p&gt;When I told him to figure it out himself, he got really annoyed and accused me of being mean to him. I genuinely didn&amp;#39;t understand how I was being mean; I just want someone who would take initiative with decisions like that. &lt;/p&gt;\n\n&lt;p&gt;He stormed off and went to play a computer game, while I sat alone in the room. After about 20 minutes, I went into the room where he was playing his game and told him that I would start cooking dinner. Around five minutes later, he abruptly came in, grabbed the saucepans and frying pans out of my hands as I was using them, and started swearing at me. He brought up our earlier conversation about how I had been mean to him, and then he told me to get the fuck out of the kitchen. I complied and left him to it. He then proceeded to shout from the kitchen ‘I’m only cooking for myself now.’&lt;/p&gt;\n\n&lt;p&gt;On one hand, I think I could be the asshole because it would have been easy for me to say, &amp;quot;just hang it up on the drying rack or on a radiator” instead of telling him to figure it out himself, and I guess pointing out that he should know where to put it so it dries because he’s an adult is a bit condescending. But, on the other hand, I feel like it&amp;#39;s reasonable to expect my partner to take the initiative in situations like this.&lt;/p&gt;\n\n&lt;p&gt;Edit: couple people asking our ages im 24 hes 25, also we’re not married&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "ecraguaeb",
          "karma": 1634,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png"
        }
      },
      {
        "postId": "14b5txf",
        "postTitle": "AITA for leaving a wedding I wasn’t invited to?",
        "username": "Jeromealis",
        "created": 1686944057,
        "comments": 196,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b5txf/aita_for_leaving_a_wedding_i_wasnt_invited_to/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife was invited to a coworker’s wedding (all day), along with a few other coworkers.  They’ve worked together for years and she was excited to go. I was happy for her but I didn’t want to go, I don’t know the bride or the other coworkers and it wasn’t going to be that exciting but got leaned on. I agreed to go and even worse be the designated driver.&lt;/p&gt;\n\n&lt;p&gt;We got to the ceremony and sat with the coworkers. No other SOs there. Bit awkward. Some quiet muttering. We watched the ceremony and then went to the reception. This was when the bride came over, seemed really embarrassed, and said she hadn’t realised my wife was bringing a plus one (ie I was not expected, probably not invited). &lt;/p&gt;\n\n&lt;p&gt;Bride said not to worry she would try to organise to fit me in and sort a meal. She was lovely about it. I said it was fine it was a misunderstanding and I would leave. Bride looked relieved but protested and we fake argued for a bit and and she then accepted I would leave. &lt;/p&gt;\n\n&lt;p&gt;My wife was not happy and suggested I waited for her in a nearby bar, which I didn’t want to do. &lt;/p&gt;\n\n&lt;p&gt;She was worried about getting home if I left. I said she could get an Uber but she was worried about the cost (it was a fair distance) - I said we could afford it as a one off. &lt;/p&gt;\n\n&lt;p&gt;She was then concerned about availability late at night and also how the others were to get back- apparently I was to drop them off as well!  I didn’t know this!&lt;/p&gt;\n\n&lt;p&gt;I offered in front of the others to take the Uber myself and leave her with the car. She was clearly furious at not being able to drink but couldn’t really say anything and agreed. &lt;/p&gt;\n\n&lt;p&gt;While I was waiting for the Uber she laid into me, saying I’d deliberately ruined her night because I didn’t want to go and now she was going to have no fun because she was driving and the bride would have been ok if I’d stayed.  &lt;/p&gt;\n\n&lt;p&gt;AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Jeromealis",
          "karma": 1716,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_7.png"
        }
      },
      {
        "postId": "14avzpq",
        "postTitle": "AITA for telling my mother I won't be coming home often anymore",
        "username": "Putrid-Apple3096",
        "created": 1686919693,
        "comments": 159,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14avzpq/aita_for_telling_my_mother_i_wont_be_coming_home/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (19F) lived with my mother (50F) full time before I moved out for college in another state. I moved pretty far and the only way to get home is on a flight. My mom is a single mom who works as a nurse, so I know she can&amp;#39;t always afford flights. I got a job to try to balance that cost for her so she wasn&amp;#39;t carrying the weight of it all.&lt;/p&gt;\n\n&lt;p&gt;This situation started months ago. Whenever I lived at home I carried most of the weight with cleaning. I go to a rigorous college and most of the time whenever I come home I&amp;#39;m super exhausted. My mother has a habit of falling off on cleaning whenever I&amp;#39;m not around and that got worse with college. I would often come home and there would be nothing cleaned, no groceries, and she didn&amp;#39;t seem to care. For example, whenever I came home for Christmas she complained about how much money she would end up having to spend on groceries and told us we would just have to figure something else out. I didn&amp;#39;t have a job at the time so it was me and my sister trying to figure out getting food. On top of that, I&amp;#39;d helped her buy a house before we left for college and when I got home nothing was unpacked and I basically spent the whole break unpacking my room. I know my mom works hard, but I expected at the minimum that she would try to set up my room and make it more comfortable for us. She also makes lots of rude comments whenever I come home. I went home this past weekend and she made comments about my weight, my finances, and asked questions about my fake ID.&lt;/p&gt;\n\n&lt;p&gt;On the ride to the airport, I told her that I didn&amp;#39;t really think that I would be coming home often. I didn&amp;#39;t enjoy feeling like I was on the defense the entire time and I didn&amp;#39;t like being a maid. I already do so so much work at school I just want to relax and be able to kick up my feet whenever I come home and I feel like she doesn&amp;#39;t understand that. She did not take this lightly and began yelling at me. She called me ungrateful and told me that so many other kids would beg to have moms like mine. I tried to rebut her saying that just because other kids would want to live in these conditions doesn&amp;#39;t mean that they&amp;#39;re good. She didn&amp;#39;t take that well and just shut down for the rest of the car ride. I explained that this wasn&amp;#39;t something that came out of left field. I&amp;#39;ve been telling her for a while that I didn&amp;#39;t like how she spoke to me and that I didn&amp;#39;t like the conditions whenever I came home and I&amp;#39;d love to find a middle ground to try to fix it. She didn&amp;#39;t make any effort to try to help me on that so I&amp;#39;m just deciding not to be around as much anymore.&lt;/p&gt;\n\n&lt;p&gt;My sister called me that night and told me that I made the right decision, but other family members have reached out to me and called me an asshole saying that I need to be more respectful of my mother and all the work that she does. I&amp;#39;m kind of torn on this because I know I did what was best for me but I also didn&amp;#39;t really want to hurt my mother&amp;#39;s feelings. so aita?&lt;/p&gt;\n\n&lt;p&gt;EDIT: there seems to be some confusion about who pays for school. i am on a full ride through questbridge, and i pay for all of my personal expenses. she does not contribute financially&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Putrid-Apple3096",
          "karma": 368,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png"
        }
      },
      {
        "postId": "14aoirc",
        "postTitle": "AITA for not wearing false eyelashes?",
        "username": "Cosmickacey",
        "created": 1686894802,
        "comments": 618,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14aoirc/aita_for_not_wearing_false_eyelashes/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my family and I (16f) were planning on going to a restaurant for dinner tonight, and my father (64m) had asked me to dress nicely for the dinner. Which I did wear a nice looking outfit as well done my makeup nicely. But I did not put on false eyelashes because they’re just uncomfortable for me and I figured that it’s just family, so it doesn’t matter. Now for further context into this, I have trichotillomania, which means that I compulsively pull out my hair. In my case, I mainly pull out my eyelashes. But at this point I have gotten better at trying to stop and my eyelashes are starting to grow back in a bit, so I decided to just put on mascara. And so we went to dinner and ate, but when we got back home, my father was extremely upset and said that I embarrassed him by not wearing any false eyelashes. My mother agreed with him and said that I should’ve listened and put more effort into my looks. But I don’t think that it was wrong for me to have not worn fake eyelashes. So AITA?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I just wanted to say thank you to everyone who’s been responding, thank you for reassuring me :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Cosmickacey",
          "karma": 944,
          "pfp": "https://styles.redditmedia.com/t5_8ktk8q/styles/profileIcon_r96zmml5036b1.jpg?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=7e9c38e71b2a18fc7b0ad259caff9f3cdc827f12"
        }
      },
      {
        "postId": "14azins",
        "postTitle": "WIBTA if I excluded my three-year-old from a family trip?",
        "username": "SuurAlaOrolo",
        "created": 1686928610,
        "comments": 121,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14azins/wibta_if_i_excluded_my_threeyearold_from_a_family/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My spouse and I have three children (9, 6, and 2.5). Before we had kids—and most years since—we have gone to an annual Con that’s about a 10-hour drive from us. We are gone from home for five days. &lt;/p&gt;\n\n&lt;p&gt;Our six- and nine-year-old are great travelers and have been since they were babies. Our toddler is, to put it mildly, not. He is sensory-seeking and kinesthetic and hates being trapped in a car seat. He screams intermittently just to hear his own voice. He is crying or whining at all times in the car unless he’s asleep. He’s also highly verbal and worships his older siblings, who in turn adore him. &lt;/p&gt;\n\n&lt;p&gt;This year (like last year) we are also taking our nephews (15 &amp;amp; 17) along with our older children. We are paying for their entrance, food, lodging, souvenirs, etc., in exchange for some childcare. We all make a Con schedule and trade off the kids. &lt;/p&gt;\n\n&lt;p&gt;Our toddler COULD come with us, and he would love the sights and sounds. He came last year and had a marvelous time. But the car ride was truly awful, and his presence curtailed what the rest of us could see and do. &lt;/p&gt;\n\n&lt;p&gt;He could also stay with his babysitter (who feels like a bonus parent to him) and/or his grandparents (who are more distant but trustworthy). He would have a great time, but the initial transition would be rough as he’s never been away from us even overnight much less for five days. I’m most concerned about him feeling left out when we get home and the kids are gushing about their experience, though he will I suppose have his own fun things to talk about. He will not understand ahead of time that he is not going to the Con. &lt;/p&gt;\n\n&lt;p&gt;WIBTA if I left him home?&lt;/p&gt;\n\n&lt;p&gt;ETA: thanks, everyone. I especially appreciated hearing from people who were went on or were left home from trips as small children and their feelings then and now, as well as other parents. And I also appreciate the tips—if we leave him (which I am now leaning toward), we will definitely do a couple of practice overnights, we will frame it as his own special adventure, and the siblings will pick out trinkets for him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "SuurAlaOrolo",
          "karma": 65583,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png"
        }
      },
      {
        "postId": "14b4trk",
        "postTitle": "AITA for being upset after getting kicked off a vacation?",
        "username": "Lopsided_Thanks8724",
        "created": 1686941586,
        "comments": 76,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b4trk/aita_for_being_upset_after_getting_kicked_off_a/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (23F) went on vacation with my boyfriend - Logan (24M) - and his dad - Rob (60sM).&lt;/p&gt;\n\n&lt;p&gt;Rob recently got a payout from legal thing (keeping details vague for privacy), so he asked Logan to road trip with him.&lt;/p&gt;\n\n&lt;p&gt;Logan is currently unemployed. He and I were best friends for years before we started dating and I have always been well acquainted with his family. Logan and I have been dating for 4 years, and I&amp;#39;ve known Rob for 8 years.&lt;/p&gt;\n\n&lt;p&gt;I asked Logan if I could fly out to meet them at certain point on their road trip. I had a bunch of PTO I hadn&amp;#39;t used, so it seemed perfect. We talked to Rob about it, and Rob was happy. He told me that he would pay for everything on the trip, including my food costs, and I insisted on buying my own flights.&lt;/p&gt;\n\n&lt;p&gt;I flew out to meet them, and it was awkward. They&amp;#39;d been traveling together for two weeks already, so I took Rob&amp;#39;s annoyance to be because he was sick of traveling. I decided to pay my expenses because Rob seemed annoyed he had to pay for me, but then he got mad at me.&lt;/p&gt;\n\n&lt;p&gt;My third night there, Rob went to bed and Logan and I went out to explore a little bit. I got into an accident and had to go to the hospital. I broke my shoulder and my jaw.&lt;/p&gt;\n\n&lt;p&gt;I only had a few more days left on the trip. I talked to the doctors, and they assured me that I would be fine to travel for 3 more days and then fly home.&lt;/p&gt;\n\n&lt;p&gt;Rob picked Logan and me up from the hospital, and as soon as I got in the car he said I needed to fly home. Logan brought up what the doctors had said, but Rob said it wasn&amp;#39;t up for discussion.&lt;/p&gt;\n\n&lt;p&gt;Logan asked Rob to drop us off somewhere. I think because Logan wanted his dad to calm down before we spoke more. Rob was outwardly very upset, but he agreed to drop us off. When we met up with Rob again for dinner, he started yelling at me in the restaurant. He said something like, &amp;quot;this is my trip, and you&amp;#39;re an uninvited guest. It&amp;#39;s time you go.&amp;quot; Rob made a jab about my parents, and I replied that my parents would never yell at me, especially in a public place.&lt;/p&gt;\n\n&lt;p&gt;I booked a hotel room for myself and told him I was going to stay, with or without him. Logan didn&amp;#39;t say anything other than to bring up again what the doctors had said. I talked to Logan about continuing his trip with his dad, but Logan insisted on staying with me. We continued the vacation for two more days and then flew home.&lt;/p&gt;\n\n&lt;p&gt;Rob cut his trip short and ended up driving back home a couple of days after Logan and I flew out.&lt;/p&gt;\n\n&lt;p&gt;Rob invited us over for dinner, and I refused to go. Logan is understanding and supports my decision. I told my family about everything that happened, and they are extremely upset by it. They think that Rob kicking me off the trip was horrendous. My parents are upset that Rob would treat me that way.&lt;/p&gt;\n\n&lt;p&gt;Personally, my feelings are hurt and I feel like Rob took away my autonomy. Logan is very supportive of my need for space, but I still feel bad about it.&lt;/p&gt;\n\n&lt;p&gt;AITA?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m getting a lot of comments that I invited myself on a father/son trip, so I&amp;#39;d like to add some context. The road trip they planned was supposed to be 2-3 months long, and I was supposed to join them for six days. I was not the only friend of the family that was to meet them along the course of their trip.&lt;/p&gt;\n\n&lt;p&gt;I had previously been invited on a different trip but couldn&amp;#39;t go because I didn&amp;#39;t have enough PTO, and when this trip came up, I mentioned to Logan how much PTO I had. (I also do not feel entitled to be invited on every trip, I&amp;#39;m just saying why I brought up how much PTO I had in the first place). Logan was excited that I could join them and he asked Rob if I could meet up with them. I was not with Logan when he asked specifically because I wanted Rob to feel comfortable saying no. They were going to a location important to my family&amp;#39;s heritage, and Rob told me directly that he was very excited to experience seeing it with me. I had no indication that Rob did not want me on the trip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Lopsided_Thanks8724",
          "karma": 291,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14auiw2",
        "postTitle": "AITA for not wanting to provide care to my Grandma?",
        "username": "WolfCheap8246",
        "created": 1686915405,
        "comments": 122,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14auiw2/aita_for_not_wanting_to_provide_care_to_my_grandma/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My parents and live together with my 93-year-old Grandma. Due to her fragility and recent broken arm, she requires assistance with showering and meal preparation. Unfortunately, her condition is unlikely to improve. Consequently, my parents have made plans for a 10-day trip and they are relying on me (26, single) to stay at their house and take care of Grandma in case of any emergencies. While my Uncle will assist with showering, I need to be present in case she falls or her persistent cough worsens.&lt;/p&gt;\n\n&lt;p&gt;I work from 7 am to 5 pm, and I must admit that I am a deep sleeper, which means I&amp;#39;m essentially unavailable for a third of the day and may not immediately notice if anything happens during another third. I&amp;#39;m currently contemplating expressing my concerns to my parents about taking on this responsibility. I lack experience in caregiving and feel uncertain about my ability to provide adequate assistance in the event of an emergency. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "WolfCheap8246",
          "karma": 115,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14b6q32",
        "postTitle": "AITA for secretly paying my daughter’s tuition?",
        "username": "BrightBulb90",
        "created": 1686946260,
        "comments": 72,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14b6q32/aita_for_secretly_paying_my_daughters_tuition/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife Diana is a lawyer and so is her father, brother and uncles. They take pride in this and it is sometimes referred to as the family occupation. I am 48 and Diana is 47. &lt;/p&gt;\n\n&lt;p&gt;Diana wants our children to go Law School and become lawyers, just like her.\nWe have three children Debby (24), Mark (21) and Alice (18). Debby is in Law School and Mark has been accepted into one. &lt;/p&gt;\n\n&lt;p&gt;Alice doesn’t want to go Law School nor become a lawyer. She wants to go to Art School instead. My wife isn’t happy about this and they got into a fight. Diana told Alice that she should pay for her own education. I told Diana that this is ridiculous and that Alice can’t pay on her own. Diana wouldn’t budge.&lt;/p&gt;\n\n&lt;p&gt;Diana earns slightly more than I do and we each pay into a joint account for any and all household expenses. What is left over we put on our individual accounts. We are generally free to do with this money as we please, but we have one rule. For very big expenditures we would ask the other before spending it. &lt;/p&gt;\n\n&lt;p&gt;We also put money into 3 college funds for our children. And we are paying for Abby and Mark from these funds. &lt;/p&gt;\n\n&lt;p&gt;After their fight, I told Alice that if she really wants to go, she should apply for Art School and I would pay for it out of my individual account. She did and was accepted. After their fight, their relationship deteriorated and they weren’t talking.&lt;/p&gt;\n\n&lt;p&gt;Only yesterday did Diana find out that Alice is going to Art School and that I am paying for it. She then got mad at me for breaking our promise of discussing big expenditures first. Then she called me an asshole.&lt;/p&gt;\n\n&lt;p&gt;I did break our promise but did it for our daughter. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "BrightBulb90",
          "karma": 17,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_0.png"
        }
      },
      {
        "postId": "14ap53o",
        "postTitle": "AITA for yelling at my brother and telling him not to expect another gift and telling him to get used to being the bad guy",
        "username": "Ok_Journalist3080",
        "created": 1686896905,
        "comments": 159,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14ap53o/aita_for_yelling_at_my_brother_and_telling_him/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My brother and SIL are expecting a little boy. She&amp;#39;s due this summer. Months ago they told us (close family and friends) the name they had chosen. We thought it was a great name and SIL was saying how happy she was. My brother made a comment about us knowing for the baby shower and in case gifts were being purchased. So my mom, sister and I bought some items with the name. SILs mom, who is disabled and chronically ill, spent months knitting a blanket with the name. I also found a sign I knew SIL wanted and bought that as a gift for them.&lt;/p&gt;\n\n&lt;p&gt;Then with a week before the baby shower my brother announces he no longer wanted the name and it was going to change. SIL was so upset. The rest of us were shocked and then I was pissed. He let so many people spend money on stuff, because he knew we were using the name on gifts and stuff, and never said a damn thing. Turns out he never liked the name. He just wanted the middle name and then could no longer live with his wife&amp;#39;s first choice for boy name.&lt;/p&gt;\n\n&lt;p&gt;The girls arranging the baby shower lost out on some money with that so they were also pissed.&lt;/p&gt;\n\n&lt;p&gt;My brother was complaining about everyone dogpiling on him and he told me I had no right to be pissed at him. I started to yell saying he had let people get used to the name, had known we were buying/making items with the name all the while he knew he didn&amp;#39;t like it, and then he turns around a week before the event with the money spent on banners and stuff and says oh well, I don&amp;#39;t like it. I told him what he allowed his MIL to do knowing how much it must have been a struggle for her and still decides to change the name like it&amp;#39;s nothing. Even seeing how much it upset his wife. I told him I was not buying more damn gifts. And that he better get used to people not liking him very much because he can&amp;#39;t just do that in a flippant manner and expect people to be okay.&lt;/p&gt;\n\n&lt;p&gt;He told me I was being unfair and it&amp;#39;s not like he was born. I said don&amp;#39;t fucking announce it then and let people use it for months. Don&amp;#39;t bring up gifts with the name because that makes it feel like an even bigger done deal. I told him he could always pay us back for what we bought and the time invested since HE changed his mind. He told me I was overreacting and I told him he knows deep down I&amp;#39;m right when everyone is mad at him. He even let slip that SIL has been cooler toward him since. &lt;/p&gt;\n\n&lt;p&gt;He told me I was an asshole and I was making it seem like he&amp;#39;s a monster for changing his mind. AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Ok_Journalist3080",
          "karma": 1702,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14avzb6",
        "postTitle": "AITA for telling my sister that our weekend trip for her birthday was a mistake?",
        "username": "Plus-Panic-4920",
        "created": 1686919658,
        "comments": 26,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14avzb6/aita_for_telling_my_sister_that_our_weekend_trip/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My (F29) sister Meg (F25) mentioned many times that she wanted to visit one particular town in the southern part of our country. What&amp;#39;s important for the story, the town in question is always full of tourists and lines to museums, restaurants and basically everywhere are very long. In summer you have to reserve tickets to some places long time before your trip if you want to visit them at all.&lt;/p&gt;\n\n&lt;p&gt;Personally I don&amp;#39;t like overly touristic places but Meg&amp;#39;s previous visit to given town went poorly and it remained an unfulfilled dream of hers. So, I decided to take her for a weekend trip there on her birthday at the very beginning of June. I told her beforehand that I&amp;#39;ll pay for the hotel, train and some of tickets/restaurant bills but she has to make a list of places she wants to see, so I can make a reservation. I gave her a &amp;quot;deadline&amp;quot; - second half of May - so I can make reservations etc.&lt;/p&gt;\n\n&lt;p&gt;May 15th came, I asked her if she has the list ready. She hadn&amp;#39;t. No biggie, I gave her few additional days. May 21st, still nothing. Eventually I booked some places I found interesting myself (some of them were no longer available anyway).&lt;/p&gt;\n\n&lt;p&gt;In the end, she didn&amp;#39;t give me a list at all. We went for a trip, seen the things I was able to book or we were able to see without reservations. But, what upset me, was that even when we reached our destination, she still didn&amp;#39;t really knew what she wanted to see. (She only twice during the trip mentioned that she&amp;#39;s interested in seeing something - both places were unavailable or had very, very long lines.)  All the time her behaviour was like &amp;quot;meh, anyway&amp;quot; - even though it was her who in the last three years constantly mentioned visiting this town. I was feeling as if I was babysitting and forcing a toddler to see things she wasn&amp;#39;t interested in.&lt;/p&gt;\n\n&lt;p&gt;I also want to mention that I don&amp;#39;t earn much and the trip, even for only a weekend, was hard for my budget, especially as I paid for almost everything.&lt;/p&gt;\n\n&lt;p&gt;Eventually I snapped at her that if she has no idea what she&amp;#39;s doing here, she shouldn&amp;#39;t constantly mention the place as she can sit in her room and play on her phone at home instead of this town. I also mentioned that I&amp;#39;ll never again plan any trip for her if she doesn&amp;#39;t want to contribute in any way.&lt;/p&gt;\n\n&lt;p&gt;Now she is mad at me, because apparently I ruined her birthday and &amp;quot;she doesn&amp;#39;t need plan to have a good trip&amp;quot;. I didn&amp;#39;t want her to plan every second of the trip, only an outline, so I was able to make reservations.&lt;/p&gt;\n\n&lt;p&gt;AITA?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Plus-Panic-4920",
          "karma": 76,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14ac6cp",
        "postTitle": "AITA for \"silencing\" my GF?",
        "username": "Alone-Fun8599",
        "created": 1686860221,
        "comments": 1756,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14ac6cp/aita_for_silencing_my_gf/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (M28) have been dating my GF, Nancy (F25), for about 2 months now. We met on a blind date that our friends set us up on and have been seeing each other relatively regularly since then. I&amp;#39;m not entirely sure if we are officially BF/GF, but Nancy seems to think so.&lt;/p&gt;\n\n&lt;p&gt;Nancy describes herself as a bit of a &amp;quot;mean girl.&amp;quot; I honestly thought she was joking for a while, as she is typically quite nice. However, she has an awful tendency to insult people based primarily on their appearance. These insults can happen anywhere and anytime, and can be targeted at literally anyone. Of course, she never says these things about the person right in front of them.&lt;/p&gt;\n\n&lt;p&gt;The other day, I invited Nancy to a family friend&amp;#39;s event we were having. My mother&amp;#39;s friend, Sarah, had just gotten out of the hospital for cancer. Sarah&amp;#39;s family and my family are very close; I&amp;#39;ve known them since I was born and consider them to be extended family.&lt;/p&gt;\n\n&lt;p&gt;Due to cancer and chemotherapy, Sarah no longer has hair and is very thin. Once Nancy saw her, she started smirking. I literally pleaded with her not to say anything rude, and she agreed but told me that I was ruining her fun.&lt;/p&gt;\n\n&lt;p&gt;Fast forward, I&amp;#39;m chatting with my mother (F55) and sister (F24). Nancy walks by and says hello. She chats for a bit before starting to make several highly offensive jokes about Sarah and her appearance. I will not repeat anything, but her jokes mainly pertained to baldness and anorexia.&lt;/p&gt;\n\n&lt;p&gt;My mother and sister looked mortified, and so was I. I literally had my jaw hanging open for a good few seconds. Once I snapped out of it, I firmly told Nancy to stop and that no one found her shitty sense of humor funny except herself. She got upset and said that I was being controlling and misogynistic for trying to silence her.&lt;/p&gt;\n\n&lt;p&gt;I maintained my position and reaffirmed that her comments were insane. She got even more upset and asked that we leave. I said it would be rude for me to go, as it was still relatively early, and she ended up leaving on her own. AITA?&lt;/p&gt;\n\n&lt;p&gt;UPDATE - I was complaining about you-know-who to my friend who introduced on the phone. He deadass told me that he introduced us on April Fools for a reason 😭&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "Alone-Fun8599",
          "karma": 9715,
          "pfp": "https://styles.redditmedia.com/t5_8m4gzz/styles/profileIcon_snoof8abbdcb-2878-473d-856f-fdefe1353d94-headshot.png?width=256&amp;height=256&amp;crop=256:256,smart&amp;v=enabled&amp;s=8c3f0830a59fb33bdade797fbbe7c0c710fbb718"
        }
      },
      {
        "postId": "14azane",
        "postTitle": "AITA for going to my stepbrother's graduation?",
        "username": "CantControlMeMom",
        "created": 1686928069,
        "comments": 56,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14azane/aita_for_going_to_my_stepbrothers_graduation/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mom and stepdad are currently not talking to my stepbrother. He just graduated from college. He invited all of the siblings to go, but not our parents. My mom said we can&amp;#39;t go because they aren&amp;#39;t invited. I wanted to go though. I have my own car, and I don&amp;#39;t think my mom&amp;#39;s disagreements should impact my life.&lt;/p&gt;\n\n&lt;p&gt;The day before the graduation I packed a bag to drive over while my parents were at work. My siblings wanted to go as well and begged me to take them. I wasn&amp;#39;t sure, because I didn&amp;#39;t know where we would sleep. I was planning to sleep in my car. They said they deserved to go too, so I caved and brought them.&lt;/p&gt;\n\n&lt;p&gt;We ended up all sleeping in my brother&amp;#39;s room. My parents called when they got home. My mom demanded we return. I said not until after the graduation. She said she would get my brother arrested, but my stepdad said we could come back the next day, but I was in trouble. We did come back after the graduation, and we are all grounded.&lt;/p&gt;\n\n&lt;p&gt;My mom said I am a disrespectful brat, but I think I should be able to go wherever I want in my own car, even if I am seventeen. She said she will take the car away, and I said fine, but I&amp;#39;m not driving my siblings to school or anywhere else, including my youngest brother&amp;#39;s summer camp. My stepdad said to stop being a jackass and apologize to my mom. Am I the jackass (hole)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "CantControlMeMom",
          "karma": 234,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png"
        }
      },
      {
        "postId": "14age0p",
        "postTitle": "AITA for wanting to disrupt my wife's routine?",
        "username": "routinedisrupt",
        "created": 1686870300,
        "comments": 1959,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/14age0p/aita_for_wanting_to_disrupt_my_wifes_routine/",
        "postText": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone, in a bit of a bind at the minute regarding the wife and some visitors.&lt;/p&gt;\n\n&lt;p&gt;My wife (31F) and I (36M) have been married for 2 years now)  and she has a very regimented wellness/mindfulness routine. She wakes up at 5am, does yoga in the spare room, goes on a quick run and comes home to make a smoothie using one of those loud nutri-ninja blenders and will get on with her day. She also meditates in there, journals and does other things that I can&amp;#39;t disrupt her because its her personal time. She was like this before I met her and was clear that if I wasn&amp;#39;t on board with this aspect of her routine, she doesn&amp;#39;t want to pursue anything with me. While I am not thrilled she has that whole room for herself (I did ask if I could put my PC in there so it&amp;#39;s not in the dining room space), it was there before I moved in with her so I made my peace with it.&lt;/p&gt;\n\n&lt;p&gt;My sister is coming into town with her partner and young daughter (6F). We both agreed on letting them stay with us to save money. My wife wants them to sleep in the living room because we have multiple comfortable sofas for them to sleep on. While there is enough room, I made my case for buying air matresses for them and to set them up in my wife&amp;#39;s spare room. I also asked her if she would part with her smoothie making at least until they wake up so they aren&amp;#39;t disturbed in the morning.&lt;/p&gt;\n\n&lt;p&gt;My wife is vehemently opposed to giving up her room and smoothies. She doesn&amp;#39;t think the room will be comfortable for them (no carpets and its got huge windows and massive mirrors on one wall) and that I&amp;#39;m using this situation as a way to disrupt her routine I apparently hate. I&amp;#39;m not sure where she got that from since I&amp;#39;ve never asked her to change it. We&amp;#39;re in a disagreement over where they should stay and my wife is event threatening to not allow them to stay and have them get a hotel for the visit. AITA? I don&amp;#39;t think giving up the room is that hard an ask for my family&amp;#39;s comfort and it&amp;#39;s only 3 days.&lt;/p&gt;\n\n&lt;p&gt;ETA - Thank you for all the advice everyone, I am heading to bed now. I have decided not to push this issue any further with my wife and my sister and family can use the sofas or I will pay partly for a hotel for them. I do plan on asking my wife about her routine and can update if people would like me to.&lt;/p&gt;\n\n&lt;p&gt;Final update - Wife was making a smoothie this morning and I approached her over her smoothie making to clear the air. I said that I was wrong to ask to use the room for them and my sister and family should sleep on the sofas and she was happy to let them stay. I also asked why she has the rigidity of her routine. We didn&amp;#39;t get into all of it but it was a start. I know my wife had a difficult upbringing in her teenage years but did not link the two that her routine was born out of those circumstances. I will not be encroaching on her room anymore and someone commented I could add heating to my garage so I could place my gaming PC in there which is a great plan. Thanks all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
        "media": null,
        "isVideo": false,
        "userData": {
          "username": "routinedisrupt",
          "karma": 3435,
          "pfp": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_0.png"
        }
      }
    ]
  }